; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image1 - mode
	image2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star6 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 image2)
	(have_image Planet9 image2)
	(have_image Star10 infrared0)
	(have_image Star11 image2)
	(have_image Planet12 image2)
	(have_image Star13 image1)
	(have_image Star14 infrared0)
))

)

; plan
1. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet7)
   goals met: 0 of 9
5. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 1 of 9
6. (turn_to satellite0 planet12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet12)
   goals met: 1 of 9
7. (take_image satellite0 planet12 instrument0 image2)
   added: (have_image planet12 image2)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon8 instrument0 image2)
   added: (have_image phenomenon8 image2)
   goals met: 3 of 9
10. (turn_to satellite0 planet9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet9)
   goals met: 3 of 9
11. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 4 of 9
12. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 4 of 9
13. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 5 of 9
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 5 of 9
15. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 6 of 9
16. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 6 of 9
17. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 7 of 9
18. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 7 of 9
19. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 8 of 9
20. (turn_to satellite0 star0 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star0)
   goals met: 9 of 9
